app/views/messages/_message.html.erb

<li>
  <span class="created_at"><%= message.created_at.strftime("%H:%M") %></span>
---
INSERT INTO "messages" ("channel_id", "content", "created_at", "from", "to", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["channel_id", 1], ["content", "Hola"], ["created_at", Sat, 12 May 2012 20:10:00 UTC +00:00], ["from", 1], ["to", nil], ["updated_at", Sat, 12 May 2012 20:10:00 UTC +00:00]]