webapp/app/views/messages/create_from_client.js.erb

	if ($("li#message-<%= @message.id %>")[0] == null){
		var msg = "<li id = 'message-<%= @message.id%>'><span class='created_at'><%= @message.created_at.strftime('%H:%M') %>"+
---
INSERT INTO "messages" ("channel_id", "content", "created_at", "from", "to", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["channel_id", 1], ["content", "No se muevan, ya regresamos"], ["created_at", Sat, 12 May 2012 23:20:12 UTC +00:00], ["from", 0], ["to", nil], ["updated_at", Sat, 12 May 2012 23:20:12 UTC +00:00]]