webapp/app/controllers/channels_controller.rb

  def index
    @channels = Channel.all
---
SELECT "channels".* FROM "channels"

  def create
    @channel = Channel.new(params[:channel])
    respond_to do |format|
      if @channel.save
---
INSERT INTO "channels" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 12 May 2012 20:09:54 UTC +00:00], ["name", "Deportes"], ["updated_at", Sat, 12 May 2012 20:09:54 UTC +00:00]]