webapp/app/controllers/messages_controller.rb

SELECT "channels".* FROM "channels"
---
  def index
    respond_to do |format|
      format.html{
        @messages = Message.messages_by_channel(current_channel,current_user)
        @users = User.users_by_channel current_channel
        @channels = Channel.all

INSERT INTO "messages" ("channel_id", "content", "created_at", "from", "to", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["channel_id", 1], ["content", "Hola"], ["created_at", Sat, 12 May 2012 20:10:00 UTC +00:00], ["from", 1], ["to", nil], ["updated_at", Sat, 12 May 2012 20:10:00 UTC +00:00]]
---
  def create
    if current_user
      respond_to do |format|
        begin
          @message = Message.new params[:message]
          @message.from , @message.channel_id  = current_user.id , current_channel.id
          if @message.save

INSERT INTO "messages" ("channel_id", "content", "created_at", "from", "to", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["channel_id", 1], ["content", "Hola mundo"], ["created_at", Sat, 12 May 2012 22:46:25 UTC +00:00], ["from", 0], ["to", nil], ["updated_at", Sat, 12 May 2012 22:46:25 UTC +00:00]]
UPDATE "messages" SET "from" = 7, "updated_at" = '2012-05-12 22:46:25.697191' WHERE "messages"."id" = 3
---
  def create_client
    client = current_user_client(params[:client_username])
    if client
      @message = Message.create! params[:message]
      @message.from = client.id
      @message.save

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 2]]
---
  def destroy
    respond_to do |format|
      format.js{
        if current_user
          Message.destroy params[:id]

UPDATE "users" SET "channel_id" = 1, "updated_at" = '2012-05-12 20:09:57.801670' WHERE "users"."id" = 1
---
  def update_chat
    unless params[:channel_id].blank?
      session[:channel_id] = params[:channel_id]
      @user_msg = "#{t(:new_channel_selected)} : #{current_channel.name}"
      current_user.channel_id = params[:channel_id]
      current_user.save

SELECT "channels".* FROM "channels" WHERE "channels"."name" = 'Deportes' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."username" = 'carlos' LIMIT 1
---
  def chat
    respond_to do |format|
      format.html{
        @messages = Message.messages_by_channel(current_channel, current_user)
        @users = User.users_by_channel current_channel
        render :layout => false
      }
      format.json{
        chat_data = Hash.new
        channel = Channel.find_by_name(params["channel"])
        user = User.find_by_username(params["username"])