webapp/app/controllers/sessions_controller.rb

INSERT INTO "users" ("channel_id", "created_at", "password", "provider", "uid", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '190527413' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)

SELECT "users".* FROM "users" WHERE "users"."username" = 'carlos' LIMIT 1
---
  def local_login
    respond_to do |format|
      format.html{
        user = User.find_by_username params["user"]["username"]