webapp/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.password = Digest::MD5.hexdigest @user.password
    @user.provider = 'local'
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("channel_id", "created_at", "password", "provider", "uid", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)